STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_ca35.h
/**
  ******************************************************************************
  * @file    stm32mp233cxx_ca35.h
  * @author  MCD Application Team
  * @brief   CMSIS stm32mp233cxx_ca35 Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral registers declarations and bits definition
  *           - Macros to access peripherals registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32mp233cxx_ca35
  * @{
  */

#ifndef __STM32MP233Cxx_CA35_H
#define __STM32MP233Cxx_CA35_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */



/**
 * @brief stm32mp2_ca35 Interrupt Number Definition :
 *        - according to the selected device in @ref Library_configuration_section
 *        - according to "Table 234. STM32MP25xx interrupt mapping for Cortex®-A35"
 *          in chapitre 32 "interrupt list" of reference document
 *          RM0457 - Reference Manual - STM32MP25xx - advanced ARM-based 32/64-bit MPUs
 *          file "DM00485804 (RM0457) Rev0.2.pdf" (Revision 0.2 / 27-Jul-2021)
 */
 typedef enum
 {
   /******  Cortex-A Processor Specific Interrupt Numbers ***************************************************************/
   /* Software Generated Interrupts                                                                                     */
   SGI0_IRQn                        =  0,     /*!< Software Generated Interrupt  0                                      */
   SGI1_IRQn                        =  1,     /*!< Software Generated Interrupt  1                                      */
   SGI2_IRQn                        =  2,     /*!< Software Generated Interrupt  2                                      */
   SGI3_IRQn                        =  3,     /*!< Software Generated Interrupt  3                                      */
   SGI4_IRQn                        =  4,     /*!< Software Generated Interrupt  4                                      */
   SGI5_IRQn                        =  5,     /*!< Software Generated Interrupt  5                                      */
   SGI6_IRQn                        =  6,     /*!< Software Generated Interrupt  6                                      */
   SGI7_IRQn                        =  7,     /*!< Software Generated Interrupt  7                                      */
   SGI8_IRQn                        =  8,     /*!< Software Generated Interrupt  8                                      */
   SGI9_IRQn                        =  9,     /*!< Software Generated Interrupt  9                                      */
   SGI10_IRQn                       = 10,     /*!< Software Generated Interrupt 10                                      */
   SGI11_IRQn                       = 11,     /*!< Software Generated Interrupt 11                                      */
   SGI12_IRQn                       = 12,     /*!< Software Generated Interrupt 12                                      */
   SGI13_IRQn                       = 13,     /*!< Software Generated Interrupt 13                                      */
   SGI14_IRQn                       = 14,     /*!< Software Generated Interrupt 14                                      */
   SGI15_IRQn                       = 15,     /*!< Software Generated Interrupt 15                                      */
   /* Private Peripheral Interrupts                                                                                     */
                                              /*!< Interrupts 16 to 24 not implemented                                  */
   RESERVED_25                      = 25,     /*!< reserved                                                             */
   HypervisorTimer_IRQn             = 26,     /*!< EL2 non-secure Timer Interrupt                                       */
   VirtualTimer_IRQn                = 27,     /*!< EL1 Virtual Timer Interrupt                                          */
   RESERVED_28                      = 28,     /*!< reserved                                                             */
   SecurePhysicalTimer_IRQn         = 29,     /*!< EL3 (Secure) Physical Timer Interrupt                                */
   NonSecurePhysicalTimer_IRQn      = 30,     /*!< EL1 Physical Timer Interrupt                                         */
   RESERVED_31                      = 31,     /*!< reserved                                                             */
   /******  STM32 specific Interrupt Numbers ****************************************************************************/
   PVD_IRQn                         = 32,     /*!< PVD detector through EXTI                                            */
   PVM_IRQn                         = 33,     /*!< PVM detector through EXTI                                            */
   IWDG1_IRQn                       = 34,     /*!< Independent Watchdog 1 Early wake interrupt                          */
   IWDG2_IRQn                       = 35,     /*!< Independent Watchdog 2 Early wake interrupt                          */
   IWDG3_RST_IRQn                   = 36,     /*!< Independent Watchdog 3 Reset through EXTI                            */
   IWDG2_RST_IRQn                   = 37,     /*!< Independent Watchdog 2 Reset through EXTI                            */
   IWDG4_RST_IRQn                   = 38,     /*!< Independent Watchdog 4 Reset through EXTI                            */
   IWDG5_RST_IRQn                   = 39,     /*!< Independent Watchdog 5 Reset through EXTI                            */
   RESERVED_40                      = 40,     /*!< reserved                                                             */
   RESERVED_41                      = 41,     /*!< reserved                                                             */
   WWDG1_RST_IRQn                   = 42,     /*!< Window Watchdog 1 Reset through EXTI                                 */
   WWDG2_RST_IRQn                   = 43,     /*!< Window Watchdog 2 Reset through EXTI                                 */
   TAMP_IRQn                        = 44,     /*!< Tamper interrupt                                                     */
   RTC_IRQn                         = 45,     /*!< RTC global interrupt                                                 */
   TAMP_S_IRQn                      = 46,     /*!< Tamper secure interrupt                                              */
   RTC_S_IRQn                       = 47,     /*!< RTC global secure interrupt                                          */
   RCC_IRQn                         = 48,     /*!< RCC global interrupt                                                 */
   EXTI2_0_IRQn                     = 49,     /*!< EXTI2 Line 0 interrupt                                               */
   EXTI2_1_IRQn                     = 50,     /*!< EXTI2 Line 1 interrupt                                               */
   EXTI2_2_IRQn                     = 51,     /*!< EXTI2 Line 2 interrupt                                               */
   EXTI2_3_IRQn                     = 52,     /*!< EXTI2 Line 3 interrupt                                               */
   EXTI2_4_IRQn                     = 53,     /*!< EXTI2 Line 4 interrupt                                               */
   EXTI2_5_IRQn                     = 54,     /*!< EXTI2 Line 5 interrupt                                               */
   EXTI2_6_IRQn                     = 55,     /*!< EXTI2 Line 6 interrupt                                               */
   EXTI2_7_IRQn                     = 56,     /*!< EXTI2 Line 7 interrupt                                               */
   EXTI2_8_IRQn                     = 57,     /*!< EXTI2 Line 8 interrupt                                               */
   EXTI2_9_IRQn                     = 58,     /*!< EXTI2 Line 9 interrupt                                               */
   EXTI2_10_IRQn                    = 59,     /*!< EXTI2 Line 10 interrupt                                              */
   EXTI2_11_IRQn                    = 60,     /*!< EXTI2 Line 11 interrupt                                              */
   EXTI2_12_IRQn                    = 61,     /*!< EXTI2 Line 12 interrupt                                              */
   EXTI2_13_IRQn                    = 62,     /*!< EXTI2 Line 13 interrupt                                              */
   EXTI2_14_IRQn                    = 63,     /*!< EXTI2 Line 14 interrupt                                              */
   EXTI2_15_IRQn                    = 64,     /*!< EXTI2 Line 15 interrupt                                              */
   HPDMA1_Channel0_IRQn             = 65,     /*!< HPDMA1 Channel0 interrupt                                            */
   HPDMA1_Channel1_IRQn             = 66,     /*!< HPDMA1 Channel1 interrupt                                            */
   HPDMA1_Channel2_IRQn             = 67,     /*!< HPDMA1 Channel2 interrupt                                            */
   HPDMA1_Channel3_IRQn             = 68,     /*!< HPDMA1 Channel3 interrupt                                            */
   HPDMA1_Channel4_IRQn             = 69,     /*!< HPDMA1 Channel4 interrupt                                            */
   HPDMA1_Channel5_IRQn             = 70,     /*!< HPDMA1 Channel5 interrupt                                            */
   HPDMA1_Channel6_IRQn             = 71,     /*!< HPDMA1 Channel6 interrupt                                            */
   HPDMA1_Channel7_IRQn             = 72,     /*!< HPDMA1 Channel7 interrupt                                            */
   HPDMA1_Channel8_IRQn             = 73,     /*!< HPDMA1 Channel8 interrupt                                            */
   HPDMA1_Channel9_IRQn             = 74,     /*!< HPDMA1 Channel9 interrupt                                            */
   HPDMA1_Channel10_IRQn            = 75,     /*!< HPDMA1 Channel10 interrupt                                           */
   HPDMA1_Channel11_IRQn            = 76,     /*!< HPDMA1 Channel11 interrupt                                           */
   HPDMA1_Channel12_IRQn            = 77,     /*!< HPDMA1 Channel12 interrupt                                           */
   HPDMA1_Channel13_IRQn            = 78,     /*!< HPDMA1 Channel13 interrupt                                           */
   HPDMA1_Channel14_IRQn            = 79,     /*!< HPDMA1 Channel14 interrupt                                           */
   HPDMA1_Channel15_IRQn            = 80,     /*!< HPDMA1 Channel15 interrupt                                           */
   HPDMA2_Channel0_IRQn             = 81,     /*!< HPDMA2 Channel0 interrupt                                            */
   HPDMA2_Channel1_IRQn             = 82,     /*!< HPDMA2 Channel1 interrupt                                            */
   HPDMA2_Channel2_IRQn             = 83,     /*!< HPDMA2 Channel2 interrupt                                            */
   HPDMA2_Channel3_IRQn             = 84,     /*!< HPDMA2 Channel3 interrupt                                            */
   HPDMA2_Channel4_IRQn             = 85,     /*!< HPDMA2 Channel4 interrupt                                            */
   HPDMA2_Channel5_IRQn             = 86,     /*!< HPDMA2 Channel5 interrupt                                            */
   HPDMA2_Channel6_IRQn             = 87,     /*!< HPDMA2 Channel6 interrupt                                            */
   HPDMA2_Channel7_IRQn             = 88,     /*!< HPDMA2 Channel7 interrupt                                            */
   HPDMA2_Channel8_IRQn             = 89,     /*!< HPDMA2 Channel8 interrupt                                            */
   HPDMA2_Channel9_IRQn             = 90,     /*!< HPDMA2 Channel9 interrupt                                            */
   HPDMA2_Channel10_IRQn            = 91,     /*!< HPDMA2 Channel10 interrupt                                           */
   HPDMA2_Channel11_IRQn            = 92,     /*!< HPDMA2 Channel11 interrupt                                           */
   HPDMA2_Channel12_IRQn            = 93,     /*!< HPDMA2 Channel12 interrupt                                           */
   HPDMA2_Channel13_IRQn            = 94,     /*!< HPDMA2 Channel13 interrupt                                           */
   HPDMA2_Channel14_IRQn            = 95,     /*!< HPDMA2 Channel14 interrupt                                           */
   HPDMA2_Channel15_IRQn            = 96,     /*!< HPDMA2 Channel15 interrupt                                           */
   HPDMA3_Channel0_IRQn             = 97,     /*!< HPDMA3 Channel0 interrupt                                            */
   HPDMA3_Channel1_IRQn             = 98,     /*!< HPDMA3 Channel1 interrupt                                            */
   HPDMA3_Channel2_IRQn             = 99,     /*!< HPDMA3 Channel2 interrupt                                            */
   HPDMA3_Channel3_IRQn             = 100,     /*!< HPDMA3 Channel3 interrupt                                           */
   HPDMA3_Channel4_IRQn             = 101,     /*!< HPDMA3 Channel4 interrupt                                           */
   HPDMA3_Channel5_IRQn             = 102,     /*!< HPDMA3 Channel5 interrupt                                           */
   HPDMA3_Channel6_IRQn             = 103,     /*!< HPDMA3 Channel6 interrupt                                           */
   HPDMA3_Channel7_IRQn             = 104,     /*!< HPDMA3 Channel7 interrupt                                           */
   HPDMA3_Channel8_IRQn             = 105,     /*!< HPDMA3 Channel8 interrupt                                           */
   HPDMA3_Channel9_IRQn             = 106,     /*!< HPDMA3 Channel9 interrupt                                           */
   HPDMA3_Channel10_IRQn            = 107,     /*!< HPDMA3 Channel10 interrupt                                          */
   HPDMA3_Channel11_IRQn            = 108,     /*!< HPDMA3 Channel11 interrupt                                          */
   HPDMA3_Channel12_IRQn            = 109,     /*!< HPDMA3 Channel12 interrupt                                          */
   HPDMA3_Channel13_IRQn            = 110,     /*!< HPDMA3 Channel13 interrupt                                          */
   HPDMA3_Channel14_IRQn            = 111,     /*!< HPDMA3 Channel14 interrupt                                          */
   HPDMA3_Channel15_IRQn            = 112,     /*!< HPDMA3 Channel15 interrupt                                          */
   LPDMA_Channel0_IRQn              = 113,     /*!< LPDMA Channel0 interrupt                                            */
   LPDMA_Channel1_IRQn              = 114,     /*!< LPDMA Channel1 interrupt                                            */
   LPDMA_Channel2_IRQn              = 115,     /*!< LPDMA Channel2 interrupt                                            */
   LPDMA_Channel3_IRQn              = 116,     /*!< LPDMA Channel3 interrupt                                            */
   ICACHE_IRQn                      = 117,     /*!< ICACHE interrupt                                                    */
   DCACHE_IRQn                      = 118,     /*!< DCACHE interrupt                                                    */
   ADC1_IRQn                        = 119,     /*!< ADC1 interrupt                                                      */
   ADC2_IRQn                        = 120,     /*!< ADC2 interrupt                                                      */
   ADC3_IRQn                        = 121,     /*!< ADC3 interrupt                                                      */
   FDCAN_CAL_IRQn                   = 122,     /*!< FDCAN CCU interrupt                                                 */
   FDCAN1_IT0_IRQn                  = 123,     /*!< FDCAN1 interrupt 0                                                  */
   FDCAN2_IT0_IRQn                  = 124,     /*!< FDCAN2 interrupt 0                                                  */
   RESERVED_417                     = 125,     /*!< reserved                                                            */
   FDCAN1_IT1_IRQn                  = 126,     /*!< FDCAN1 interrupt 1                                                  */
   FDCAN2_IT1_IRQn                  = 127,     /*!< FDCAN2 interrupt 1                                                  */
   RESERVED_418                     = 128,     /*!< reserved                                                            */
   TIM1_BRK_IRQn                    = 129,     /*!< TIM1 Break interrupt                                                */
   TIM1_UP_IRQn                     = 130,     /*!< TIM1 update interrupt                                               */
   TIM1_TRG_COM_IRQn                = 131,     /*!< TIM1 Trigger and Commutation interrupts                             */
   TIM1_CC_IRQn                     = 132,     /*!< TIM1 Capture Compare interrupt                                      */
   RESERVED_419                     = 133,     /*!< reserved                                                            */
   RESERVED_420                     = 134,     /*!< reserved                                                            */
   RESERVED_421                     = 135,     /*!< reserved                                                            */
   RESERVED_422                     = 136,     /*!< reserved                                                            */   
   TIM2_IRQn                        = 137,     /*!< TIM2 global interrupt                                               */
   TIM3_IRQn                        = 138,     /*!< TIM3 global interrupt                                               */
   TIM4_IRQn                        = 139,     /*!< TIM4 global interrupt                                               */
   I2C1_IRQn                        = 140,     /*!< I2C1 global interrupt                                               */
   I3C1_IRQn                        = 141,     /*!< I3C1 global interrupt                                               */
   I2C2_IRQn                        = 142,     /*!< I2C2 global interrupt                                               */
   I3C2_IRQn                        = 143,     /*!< I3C2 global interrupt                                               */
   SPI1_IRQn                        = 144,     /*!< SPI1 global interrupt                                               */
   SPI2_IRQn                        = 145,     /*!< SPI2 global interrupt                                               */
   USART1_IRQn                      = 146,     /*!< USART1 interrupt                                                    */
   USART2_IRQn                      = 147,     /*!< USART2 interrupt                                                    */
   USART3_IRQn                      = 148,     /*!< USART3 interrupt                                                    */
   RESERVED_149                     = 149,     /*!< reserved                                                            */
   TIM8_BRK_IRQn                    = 150,     /*!< TIM8 Break interrupt                                                */
   TIM8_UP_IRQn                     = 151,     /*!< TIM8 update interrupt                                               */
   TIM8_TRG_COM_IRQn                = 152,     /*!< TIM8 Trigger and Commutation interrupts                             */
   TIM8_CC_IRQn                     = 153,     /*!< TIM8 Capture Compare interrupt                                      */
   FMC_IRQn                         = 154,     /*!< FMC global interrupt                                                */
   SDMMC1_IRQn                      = 155,     /*!< SDMMC1 global interrupt                                             */
   TIM5_IRQn                        = 156,     /*!< TIMER5 global interrupt                                             */
   SPI3_IRQn                        = 157,     /*!< SPI3 global interrupt                                               */
   UART4_IRQn                       = 158,     /*!< UART4 interrupt                                                     */
   UART5_IRQn                       = 159,     /*!< UART5 interrupt                                                     */
   TIM6_IRQn                        = 160,     /*!< TIMER6 global interrupt                                             */
   TIM7_IRQn                        = 161,     /*!< TIMER7 global interrupt                                             */
   ETH1_SBD_IRQn                    = 162,     /*!< ETH1 global interrupt                                               */
   ETH1_PMT_IRQn                    = 163,     /*!< ETH1 wake-up interrupt (PMT)                                        */
   ETH1_LPI_IRQn                    = 164,     /*!< ETH1 LPI interrupt                                                  */
   ETH2_SBD_IRQn                    = 165,     /*!< ETH2 global interrupt                                               */
   ETH2_PMT_IRQn                    = 166,     /*!< ETH2 wake-up interrupt (PMT)                                        */
   ETH2_LPI_IRQn                    = 167,     /*!< ETH2 LPI interrupt                                                  */
   USART6_IRQn                      = 168,     /*!< USART6 interrupt                                                    */
   RESERVED_427                     = 169,     /*!< reserved                                                            */
   RESERVED_428                     = 170,     /*!< reserved                                                            */
   USBH_EHCI_IRQn                   = 171,     /*!< USB Host EHCI interrupt                                             */
   USBH_OHCI_IRQn                   = 172,     /*!< USB Host OHCI interrupt                                             */
   DCMI_PSSI_IRQn                   = 173,     /*!< DCMI & PSSI global interrupt                                        */
