STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_ca35.h
typedef struct{
  __IO uint32_t CFGR;            /*!< FMC common configuration register                      Address offset: 0x020 */
       uint32_t RESERVED0[183];  /*!< Reserved                                               Address offset: 0x024-0x2FC */
  __IO uint32_t SECCFGR;         /*!< FMC security configuration register                    Address offset: 0x300 */
  __IO uint32_t PRIVCFGR;        /*!< FMC security configuration register                    Address offset: 0x304 */
  __IO uint32_t RCFGLOCK;        /*!< FMC CID configuration lock register                    Address offset: 0x308 */
  __IO uint32_t CIDCFGR0;        /*!< FMC resource 0 CID Register                            Address offset: 0x30C */
  __IO uint32_t SEMCR0;          /*!< FMC Resource 0 Semaphore Control Register              Address offset: 0x310 */
  __IO uint32_t CIDCFGR1;        /*!< FMC resource 1 CID Register                            Address offset: 0x314 */
  __IO uint32_t SEMCR1;          /*!< FMC Resource 1 Semaphore Control Register              Address offset: 0x318 */
  __IO uint32_t CIDCFGR2;        /*!< FMC resource 2 CID Register                            Address offset: 0x31C */
  __IO uint32_t SEMCR2;          /*!< FMC Resource 2 Semaphore Control Register              Address offset: 0x320 */
  __IO uint32_t CIDCFGR3;        /*!< FMC resource 3 CID Register                            Address offset: 0x324 */
  __IO uint32_t SEMCR3;          /*!< FMC Resource 3 Semaphore Control Register              Address offset: 0x328 */
  __IO uint32_t CIDCFGR4;        /*!< FMC resource 4 CID Register                            Address offset: 0x32C */
  __IO uint32_t SEMCR4;          /*!< FMC Resource 4 Semaphore Control Register              Address offset: 0x330 */
  __IO uint32_t CIDCFGR5;        /*!< FMC resource 5 CID Register                            Address offset: 0x334 */
  __IO uint32_t SEMCR5;          /*!< FMC Resource 5 Semaphore Control Register              Address offset: 0x338 */
       uint32_t RESERVED1[43];   /*!< Reserved                                               Address offset: 0x33C-0x3E4 */
  __IO uint32_t HWCFGR3;         /*!< FMC Hardware configuration register 3                  Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< FMC Hardware configuration register 2                  Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< FMC Hardware configuration register 1                  Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< FMC Version register                                   Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< FMC Identification register                            Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< FMC Size Identification register                       Address offset: 0x3FC */
} FMC_Common_TypeDef;

/*
 * @brief  (GICV2M)
 */
typedef struct
{
       uint32_t RESERVED0[2];     /*!< Reserved                  Address offset: 0x000-0x004 */
  __IO uint32_t TYPER;            /*!< GICV2M typer register     Address offset: 0x008 */
       uint32_t RESERVED1[13];    /*!< Reserved                  Address offset: 0x00C-0x03C */
  __IO uint32_t SETSPI;           /*!< GICV2M set SPI register   Address offset: 0x040 */
       uint32_t RESERVED2[47];    /*!< Reserved                  Address offset: 0x044-0x0FC */
  __IO uint32_t MISC_CTRL;        /*!< GICV2M MISC CTRL register Address offset: 0x100 */
       uint32_t RESERVED3[946];   /*!< Reserved                  Address offset: 0x104-0xFC8 */
  __IO uint32_t IIDR;             /*!< GICV2M IIDR register      Address offset: 0xFCC */
} GICV2M_TypeDef;

/**
* @brief General Purpose I/O
* @note c7amba_ioport4 Rev 1.0.2
*/
typedef struct
{
  __IO uint32_t MODER;           /*!< GPIO mode register                                  Address offset: 0x000 */
  __IO uint32_t OTYPER;          /*!< GPIO output type register                           Address offset: 0x004 */
  __IO uint32_t OSPEEDR;         /*!< GPIO output speed register                          Address offset: 0x008 */
  __IO uint32_t PUPDR;           /*!< GPIO port pull-up/pull-down register                Address offset: 0x00C */
  __IO uint32_t IDR;             /*!< GPIO input data register                            Address offset: 0x010 */
  __IO uint32_t ODR;             /*!< GPIO output data register                           Address offset: 0x014 */
  __IO uint32_t BSRR;            /*!< GPIO bit set/reset register                         Address offset: 0x018 */
  __IO uint32_t LCKR;            /*!< GPIO configuration lock register                    Address offset: 0x01C */
  __IO uint32_t AFR[2];          /*!< GPIO alternate function  registers                  Address offset: 0x020 */
  __IO uint32_t BRR;             /*!< GPIO bit reset register                             Address offset: 0x028 */
  __IO uint32_t OR;              /*!< GPIO bit option register                            Address offset: 0x02C */
  __IO uint32_t SECCFGR;         /*!< GPIO secure configuration register                  Address offset: 0x030 */
  __IO uint32_t PRIVCFGR;        /*!< GPIO privileged configuration register              Address offset: 0x034 */
  __IO uint32_t RCFGLOCKR;       /*!< GPIO resource configuration lock register           Address offset: 0x038 */
       uint32_t RESERVED0;       /*!< Reserved                                            Address offset: 0x03C */
  __IO uint32_t DELAYRL;         /*!< GPIO delay low register                             Address offset: 0x040 */
  __IO uint32_t DELAYRH;         /*!< GPIO delay high register                            Address offset: 0x044 */
  __IO uint32_t ADVCFGRL;        /*!< GPIO PIO control low register                       Address offset: 0x048 */
  __IO uint32_t ADVCFGRH;        /*!< GPIO delay high register                            Address offset: 0x04C */

  __IO uint32_t CIDCFGR0;        /*!< GPIO CID configuration register for I/O pin 0       Address offset: 0x050 */
  __IO uint32_t SEMCR0;          /*!< GPIO semaphore control register for I/O pin 0       Address offset: 0x054 */
  __IO uint32_t CIDCFGR1;        /*!< GPIO CID configuration register for I/O pin 1       Address offset: 0x058 */
  __IO uint32_t SEMCR1;          /*!< GPIO semaphore control register for I/O pin 1       Address offset: 0x05C */
  __IO uint32_t CIDCFGR2;        /*!< GPIO CID configuration register for I/O pin 2       Address offset: 0x060 */
  __IO uint32_t SEMCR2;          /*!< GPIO semaphore control register for I/O pin 2       Address offset: 0x064 */
  __IO uint32_t CIDCFGR3;        /*!< GPIO CID configuration register for I/O pin 3       Address offset: 0x068 */
  __IO uint32_t SEMCR3;          /*!< GPIO semaphore control register for I/O pin 3       Address offset: 0x06C */
  __IO uint32_t CIDCFGR4;        /*!< GPIO CID configuration register for I/O pin 4       Address offset: 0x070 */
  __IO uint32_t SEMCR4;          /*!< GPIO semaphore control register for I/O pin 4       Address offset: 0x074 */
  __IO uint32_t CIDCFGR5;        /*!< GPIO CID configuration register for I/O pin 5       Address offset: 0x078 */
  __IO uint32_t SEMCR5;          /*!< GPIO semaphore control register for I/O pin 5       Address offset: 0x07C */
  __IO uint32_t CIDCFGR6;        /*!< GPIO CID configuration register for I/O pin 6       Address offset: 0x080 */
  __IO uint32_t SEMCR6;          /*!< GPIO semaphore control register for I/O pin 6       Address offset: 0x084 */
  __IO uint32_t CIDCFGR7;        /*!< GPIO CID configuration register for I/O pin 7       Address offset: 0x088 */
  __IO uint32_t SEMCR7;          /*!< GPIO semaphore control register for I/O pin 7       Address offset: 0x08C */
  __IO uint32_t CIDCFGR8;        /*!< GPIO CID configuration register for I/O pin 8       Address offset: 0x090 */
  __IO uint32_t SEMCR8;          /*!< GPIO semaphore control register for I/O pin 8       Address offset: 0x094 */
  __IO uint32_t CIDCFGR9;        /*!< GPIO CID configuration register for I/O pin 9       Address offset: 0x098 */
  __IO uint32_t SEMCR9;          /*!< GPIO semaphore control register for I/O pin 9       Address offset: 0x09C */
  __IO uint32_t CIDCFGR10;       /*!< GPIO CID configuration register for I/O pin 10      Address offset: 0x0A0 */
  __IO uint32_t SEMCR10;         /*!< GPIO semaphore control register for I/O pin 10      Address offset: 0x0A4 */
  __IO uint32_t CIDCFGR11;       /*!< GPIO CID configuration register for I/O pin 11      Address offset: 0x0A8 */
  __IO uint32_t SEMCR11;         /*!< GPIO semaphore control register for I/O pin 11      Address offset: 0x0AC */
  __IO uint32_t CIDCFGR12;       /*!< GPIO CID configuration register for I/O pin 12      Address offset: 0x0B0 */
  __IO uint32_t SEMCR12;         /*!< GPIO semaphore control register for I/O pin 12      Address offset: 0x0B4 */
  __IO uint32_t CIDCFGR13;       /*!< GPIO CID configuration register for I/O pin 13      Address offset: 0x0B8 */
  __IO uint32_t SEMCR13;         /*!< GPIO semaphore control register for I/O pin 13      Address offset: 0x0BC */
  __IO uint32_t CIDCFGR14;       /*!< GPIO CID configuration register for I/O pin 14      Address offset: 0x0C0 */
  __IO uint32_t SEMCR14;         /*!< GPIO semaphore control register for I/O pin 14      Address offset: 0x0C4 */
  __IO uint32_t CIDCFGR15;       /*!< GPIO CID configuration register for I/O pin 15      Address offset: 0x0C8 */
  __IO uint32_t SEMCR15;         /*!< GPIO semaphore control register for I/O pin 15      Address offset: 0x0CC */
       uint32_t RESERVED1[190];  /*!< Reserved                                            Address offset: 0x0D0-0x3C4 */
  __IO uint32_t HWCFGR10;        /*!< GPIO hardware configuration register 10             Address offset: 0x3C8 */
  __IO uint32_t HWCFGR9;         /*!< GPIO hardware configuration register 9              Address offset: 0x3CC */
  __IO uint32_t HWCFGR8;         /*!< GPIO hardware configuration register 8              Address offset: 0x3D0 */
  __IO uint32_t HWCFGR7;         /*!< GPIO hardware configuration register 7              Address offset: 0x3D4 */
  __IO uint32_t HWCFGR6;         /*!< GPIO hardware configuration register 6              Address offset: 0x3D8 */
  __IO uint32_t HWCFGR5;         /*!< GPIO hardware configuration register 5              Address offset: 0x3DC */
  __IO uint32_t HWCFGR4;         /*!< GPIO hardware configuration register 4              Address offset: 0x3E0 */
  __IO uint32_t HWCFGR3;         /*!< GPIO hardware configuration register 3              Address offset: 0x3E4 */
  __IO uint32_t HWCFGR2;         /*!< GPIO hardware configuration register 2              Address offset: 0x3E8 */
  __IO uint32_t HWCFGR1;         /*!< GPIO hardware configuration register 1              Address offset: 0x3EC */
  __IO uint32_t HWCFGR0;         /*!< GPIO hardware configuration register 0              Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< GPIO version register                               Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< GPIO identification register                        Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< GPIO size identification register                   Address offset: 0x3FC */
} GPIO_TypeDef;

/**
  * @brief HASH
  */
/* HASH (c7amba_hash1@v4.0) */
typedef struct
{
  __IO uint32_t CR;               /*!< HASH control register,                             Address offset: 0x00        */
  __IO uint32_t DIN;              /*!< HASH data input register,                          Address offset: 0x04        */
  __IO uint32_t STR;              /*!< HASH start register,                               Address offset: 0x08        */
  __IO uint32_t HR[5];            /*!< HASH digest registers,                             Address offset: 0x0C-0x1C   */
  __IO uint32_t IMR;              /*!< HASH interrupt enable register,                    Address offset: 0x20        */
  __IO uint32_t SR;               /*!< HASH status register,                              Address offset: 0x24        */
  __IO uint32_t SHA3CFGR;         /*!< HASH SHA3 config. register                         Address offset: 0x28        */
       uint32_t RESERVED[51];
  __IO uint32_t CSR[103];         /*!< HASH context swap registers,                       Address offset: 0x0F8-0x290 */
       uint32_t RESERVED2[31];
  __IO uint32_t HR2[50];          /*!< HASH digest supplementary registers,               Address offset: 0x310-0x3D4 */
       uint32_t RESERVED3[6];
  __IO uint32_t HWCFGR;           /*!< HASH Hardware configuration register,              Address offset: 0x3F0 */
  __IO uint32_t VERR;             /*!< HASH Version register,                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;            /*!< HASH identification register,                      Address offset: 0x3F8 */
  __IO uint32_t MID;              /*!< HASH Hardware Magic ID register,                   Address offset: 0x3FC */
} HASH_TypeDef;

/**
  * @brief HASH_DIGEST
  */
/* HASH (c7amba_hash1@v3.0) */
typedef struct
{
  __IO uint32_t HR[50];     /*!< HASH digest registers,          Address offset: 0x310-0x3D4 */
} HASH_DIGEST_TypeDef;

