STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_ca35.h
/***********  Bit definition for ETH_TX_PACKET_COUNT_GOOD register  ***********/
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Pos                             (0U)
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Msk                             (0xFFFFFFFFUL << ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG                                 ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Msk                                      /*!< Tx Packet Count Good */

/*******  Bit definition for ETH_TX_EXCESSIVE_DEFERRAL_ERROR register  ********/
#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_Pos                    (0U)
#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_Msk                    (0xFFFFFFFFUL << ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_Pos)            /*!< 0xFFFFFFFF */
#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF                        ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_Msk                             /*!< Tx Excessive Deferral Error */

/*************  Bit definition for ETH_TX_PAUSE_PACKETS register  *************/
#define ETH_TX_PAUSE_PACKETS_TXPAUSE_Pos                                (0U)
#define ETH_TX_PAUSE_PACKETS_TXPAUSE_Msk                                (0xFFFFFFFFUL << ETH_TX_PAUSE_PACKETS_TXPAUSE_Pos)                        /*!< 0xFFFFFFFF */
#define ETH_TX_PAUSE_PACKETS_TXPAUSE                                    ETH_TX_PAUSE_PACKETS_TXPAUSE_Msk                                         /*!< Tx Pause Packets */

/***********  Bit definition for ETH_TX_VLAN_PACKETS_GOOD register  ***********/
#define ETH_TX_VLAN_PACKETS_GOOD_TXVLANG_Pos                            (0U)
#define ETH_TX_VLAN_PACKETS_GOOD_TXVLANG_Msk                            (0xFFFFFFFFUL << ETH_TX_VLAN_PACKETS_GOOD_TXVLANG_Pos)                    /*!< 0xFFFFFFFF */
#define ETH_TX_VLAN_PACKETS_GOOD_TXVLANG                                ETH_TX_VLAN_PACKETS_GOOD_TXVLANG_Msk                                     /*!< Tx VLAN Packets Good */

/**********  Bit definition for ETH_TX_OSIZE_PACKETS_GOOD register  ***********/
#define ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_Pos                           (0U)
#define ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_Msk                           (0xFFFFFFFFUL << ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_Pos)                   /*!< 0xFFFFFFFF */
#define ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG                               ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_Msk                                    /*!< Tx OSize Packets Good */

/********  Bit definition for ETH_RX_PACKETS_COUNT_GOOD_BAD register  *********/
#define ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_Pos                       (0U)
#define ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_Msk                       (0xFFFFFFFFUL << ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_Pos)               /*!< 0xFFFFFFFF */
#define ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB                           ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_Msk                                /*!< Rx Packets Count Good Bad */

/*********  Bit definition for ETH_RX_OCTET_COUNT_GOOD_BAD register  **********/
#define ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_Pos                         (0U)
#define ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_Msk                         (0xFFFFFFFFUL << ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB                             ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_Msk                                  /*!< Rx Octet Count Good Bad */

/***********  Bit definition for ETH_RX_OCTET_COUNT_GOOD register  ************/
#define ETH_RX_OCTET_COUNT_GOOD_RXOCTG_Pos                              (0U)
#define ETH_RX_OCTET_COUNT_GOOD_RXOCTG_Msk                              (0xFFFFFFFFUL << ETH_RX_OCTET_COUNT_GOOD_RXOCTG_Pos)                      /*!< 0xFFFFFFFF */
#define ETH_RX_OCTET_COUNT_GOOD_RXOCTG                                  ETH_RX_OCTET_COUNT_GOOD_RXOCTG_Msk                                       /*!< Rx Octet Count Good */

/********  Bit definition for ETH_RX_BROADCAST_PACKETS_GOOD register  *********/
#define ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_Pos                      (0U)
#define ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_Msk                      (0xFFFFFFFFUL << ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG                          ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_Msk                               /*!< Rx Broadcast Packets Good */

/********  Bit definition for ETH_RX_MULTICAST_PACKETS_GOOD register  *********/
#define ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_Pos                      (0U)
#define ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_Msk                      (0xFFFFFFFFUL << ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG                          ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_Msk                               /*!< Rx Multicast Packets Good */

/***********  Bit definition for ETH_RX_CRC_ERROR_PACKETS register  ***********/
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Pos                           (0U)
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Msk                           (0xFFFFFFFFUL << ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Pos)                   /*!< 0xFFFFFFFF */
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR                               ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Msk                                    /*!< Rx CRC Error Packets */

/********  Bit definition for ETH_RX_ALIGNMENT_ERROR_PACKETS register  ********/
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Pos                    (0U)
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Msk                    (0xFFFFFFFFUL << ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Pos)            /*!< 0xFFFFFFFF */
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR                        ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Msk                             /*!< Rx Alignment Error Packets */

