STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_ca35.h
/* Bit fields for RCC_USART3CFGR register */
#define RCC_USART3CFGR_USART3RST_Pos                 (0U)
#define RCC_USART3CFGR_USART3RST_Msk                 (0x1UL << RCC_USART3CFGR_USART3RST_Pos)                /*!< 0x00000001 */
#define RCC_USART3CFGR_USART3RST                     RCC_USART3CFGR_USART3RST_Msk                          /*!< USART3 reset */
#define RCC_USART3CFGR_USART3EN_Pos                  (1U)
#define RCC_USART3CFGR_USART3EN_Msk                  (0x1UL << RCC_USART3CFGR_USART3EN_Pos)                 /*!< 0x00000002 */
#define RCC_USART3CFGR_USART3EN                      RCC_USART3CFGR_USART3EN_Msk                           /*!< USART3 clock enable */
#define RCC_USART3CFGR_USART3LPEN_Pos                (2U)
#define RCC_USART3CFGR_USART3LPEN_Msk                (0x1UL << RCC_USART3CFGR_USART3LPEN_Pos)               /*!< 0x00000004 */
#define RCC_USART3CFGR_USART3LPEN                    RCC_USART3CFGR_USART3LPEN_Msk                         /*!< USART3 clock enable during CSleep  */

/* Bit fields for RCC_UART4CFGR register */
#define RCC_UART4CFGR_UART4RST_Pos                   (0U)
#define RCC_UART4CFGR_UART4RST_Msk                   (0x1UL << RCC_UART4CFGR_UART4RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART4CFGR_UART4RST                       RCC_UART4CFGR_UART4RST_Msk                            /*!< UART4 reset */
#define RCC_UART4CFGR_UART4EN_Pos                    (1U)
#define RCC_UART4CFGR_UART4EN_Msk                    (0x1UL << RCC_UART4CFGR_UART4EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART4CFGR_UART4EN                        RCC_UART4CFGR_UART4EN_Msk                             /*!< UART4 clock enable */
#define RCC_UART4CFGR_UART4LPEN_Pos                  (2U)
#define RCC_UART4CFGR_UART4LPEN_Msk                  (0x1UL << RCC_UART4CFGR_UART4LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART4CFGR_UART4LPEN                      RCC_UART4CFGR_UART4LPEN_Msk                           /*!< UART4 clock enable during CSleep */

/* Bit fields for RCC_UART5CFGR register */
#define RCC_UART5CFGR_UART5RST_Pos                   (0U)
#define RCC_UART5CFGR_UART5RST_Msk                   (0x1UL << RCC_UART5CFGR_UART5RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART5CFGR_UART5RST                       RCC_UART5CFGR_UART5RST_Msk                            /*!< UART5 reset */
#define RCC_UART5CFGR_UART5EN_Pos                    (1U)
#define RCC_UART5CFGR_UART5EN_Msk                    (0x1UL << RCC_UART5CFGR_UART5EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART5CFGR_UART5EN                        RCC_UART5CFGR_UART5EN_Msk                             /*!< UART5 clock enable */
#define RCC_UART5CFGR_UART5LPEN_Pos                  (2U)
#define RCC_UART5CFGR_UART5LPEN_Msk                  (0x1UL << RCC_UART5CFGR_UART5LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART5CFGR_UART5LPEN                      RCC_UART5CFGR_UART5LPEN_Msk                           /*!< UART5 clock enable during CSleep */

/* Bit fields for RCC_USART6CFGR register */
#define RCC_USART6CFGR_USART6RST_Pos                 (0U)
#define RCC_USART6CFGR_USART6RST_Msk                 (0x1UL << RCC_USART6CFGR_USART6RST_Pos)                /*!< 0x00000001 */
#define RCC_USART6CFGR_USART6RST                     RCC_USART6CFGR_USART6RST_Msk                          /*!< USART6 reset */
#define RCC_USART6CFGR_USART6EN_Pos                  (1U)
#define RCC_USART6CFGR_USART6EN_Msk                  (0x1UL << RCC_USART6CFGR_USART6EN_Pos)                 /*!< 0x00000002 */
#define RCC_USART6CFGR_USART6EN                      RCC_USART6CFGR_USART6EN_Msk                           /*!< USART6 clock enable */
#define RCC_USART6CFGR_USART6LPEN_Pos                (2U)
#define RCC_USART6CFGR_USART6LPEN_Msk                (0x1UL << RCC_USART6CFGR_USART6LPEN_Pos)               /*!< 0x00000004 */
#define RCC_USART6CFGR_USART6LPEN                    RCC_USART6CFGR_USART6LPEN_Msk                         /*!< USART6 clock enable during CSleep  */

/* Bit fields for RCC_UART7CFGR register */
#define RCC_UART7CFGR_UART7RST_Pos                   (0U)
#define RCC_UART7CFGR_UART7RST_Msk                   (0x1UL << RCC_UART7CFGR_UART7RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART7CFGR_UART7RST                       RCC_UART7CFGR_UART7RST_Msk                            /*!< UART7 reset */
#define RCC_UART7CFGR_UART7EN_Pos                    (1U)
#define RCC_UART7CFGR_UART7EN_Msk                    (0x1UL << RCC_UART7CFGR_UART7EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART7CFGR_UART7EN                        RCC_UART7CFGR_UART7EN_Msk                             /*!< UART7 clock enable */
#define RCC_UART7CFGR_UART7LPEN_Pos                  (2U)
#define RCC_UART7CFGR_UART7LPEN_Msk                  (0x1UL << RCC_UART7CFGR_UART7LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART7CFGR_UART7LPEN                      RCC_UART7CFGR_UART7LPEN_Msk                           /*!< UART7 clock enable during CSleep  */

/* Bit fields for RCC_LPUART1CFGR register */
#define RCC_LPUART1CFGR_LPUART1RST_Pos               (0U)
#define RCC_LPUART1CFGR_LPUART1RST_Msk               (0x1UL << RCC_LPUART1CFGR_LPUART1RST_Pos)              /*!< 0x00000001 */
#define RCC_LPUART1CFGR_LPUART1RST                   RCC_LPUART1CFGR_LPUART1RST_Msk                        /*!< LPUART1 reset */
#define RCC_LPUART1CFGR_LPUART1EN_Pos                (1U)
#define RCC_LPUART1CFGR_LPUART1EN_Msk                (0x1UL << RCC_LPUART1CFGR_LPUART1EN_Pos)               /*!< 0x00000002 */
#define RCC_LPUART1CFGR_LPUART1EN                    RCC_LPUART1CFGR_LPUART1EN_Msk                         /*!< LPUART1 clock enable */
#define RCC_LPUART1CFGR_LPUART1LPEN_Pos              (2U)
#define RCC_LPUART1CFGR_LPUART1LPEN_Msk              (0x1UL << RCC_LPUART1CFGR_LPUART1LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPUART1CFGR_LPUART1LPEN                  RCC_LPUART1CFGR_LPUART1LPEN_Msk                       /*!< LPUART1 clock enable during CSleep  */
#define RCC_LPUART1CFGR_LPUART1AMEN_Pos              (3U)
#define RCC_LPUART1CFGR_LPUART1AMEN_Msk              (0x1UL << RCC_LPUART1CFGR_LPUART1AMEN_Pos)             /*!< 0x00000008 */
#define RCC_LPUART1CFGR_LPUART1AMEN                  RCC_LPUART1CFGR_LPUART1AMEN_Msk                       /*!< LPUART1 autonomous clock mode enable */

/* Bit fields for RCC_I2C1CFGR register */
#define RCC_I2C1CFGR_I2C1RST_Pos                     (0U)
#define RCC_I2C1CFGR_I2C1RST_Msk                     (0x1UL << RCC_I2C1CFGR_I2C1RST_Pos)                    /*!< 0x00000001 */
#define RCC_I2C1CFGR_I2C1RST                         RCC_I2C1CFGR_I2C1RST_Msk                              /*!< I2C1 reset */
#define RCC_I2C1CFGR_I2C1EN_Pos                      (1U)
#define RCC_I2C1CFGR_I2C1EN_Msk                      (0x1UL << RCC_I2C1CFGR_I2C1EN_Pos)                     /*!< 0x00000002 */
#define RCC_I2C1CFGR_I2C1EN                          RCC_I2C1CFGR_I2C1EN_Msk                               /*!< I2C1 clock enable */
#define RCC_I2C1CFGR_I2C1LPEN_Pos                    (2U)
#define RCC_I2C1CFGR_I2C1LPEN_Msk                    (0x1UL << RCC_I2C1CFGR_I2C1LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I2C1CFGR_I2C1LPEN                        RCC_I2C1CFGR_I2C1LPEN_Msk                             /*!< I2C1 clock enable during CSleep  */
/* Bit fields for RCC_I2C2CFGR register */
#define RCC_I2C2CFGR_I2C2RST_Pos                     (0U)
#define RCC_I2C2CFGR_I2C2RST_Msk                     (0x1UL << RCC_I2C2CFGR_I2C2RST_Pos)                    /*!< 0x00000001 */
#define RCC_I2C2CFGR_I2C2RST                         RCC_I2C2CFGR_I2C2RST_Msk                              /*!< I2C2 reset */
#define RCC_I2C2CFGR_I2C2EN_Pos                      (1U)
#define RCC_I2C2CFGR_I2C2EN_Msk                      (0x1UL << RCC_I2C2CFGR_I2C2EN_Pos)                     /*!< 0x00000002 */
#define RCC_I2C2CFGR_I2C2EN                          RCC_I2C2CFGR_I2C2EN_Msk                               /*!< I2C2 clock enable */
#define RCC_I2C2CFGR_I2C2LPEN_Pos                    (2U)
#define RCC_I2C2CFGR_I2C2LPEN_Msk                    (0x1UL << RCC_I2C2CFGR_I2C2LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I2C2CFGR_I2C2LPEN                        RCC_I2C2CFGR_I2C2LPEN_Msk                             /*!< I2C2 clock enable during CSleep  */

/* Bit fields for RCC_I2C7CFGR register */
#define RCC_I2C7CFGR_I2C7RST_Pos                     (0U)
#define RCC_I2C7CFGR_I2C7RST_Msk                     (0x1UL << RCC_I2C7CFGR_I2C7RST_Pos)                    /*!< 0x00000001 */
#define RCC_I2C7CFGR_I2C7RST                         RCC_I2C7CFGR_I2C7RST_Msk                              /*!< I2C7 reset */
#define RCC_I2C7CFGR_I2C7EN_Pos                      (1U)
#define RCC_I2C7CFGR_I2C7EN_Msk                      (0x1UL << RCC_I2C7CFGR_I2C7EN_Pos)                     /*!< 0x00000002 */
#define RCC_I2C7CFGR_I2C7EN                          RCC_I2C7CFGR_I2C7EN_Msk                               /*!< I2C7 clock enable */
#define RCC_I2C7CFGR_I2C7LPEN_Pos                    (2U)
#define RCC_I2C7CFGR_I2C7LPEN_Msk                    (0x1UL << RCC_I2C7CFGR_I2C7LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I2C7CFGR_I2C7LPEN                        RCC_I2C7CFGR_I2C7LPEN_Msk                             /*!< I2C7 clock enable during CSleep  */

/* Bit fields for RCC_I2C8CFGR register */
#define RCC_I2C8CFGR_I2C8RST_Pos                     (0U)
#define RCC_I2C8CFGR_I2C8RST_Msk                     (0x1UL << RCC_I2C8CFGR_I2C8RST_Pos)                    /*!< 0x00000001 */
#define RCC_I2C8CFGR_I2C8RST                         RCC_I2C8CFGR_I2C8RST_Msk                              /*!< I2C8 reset */
#define RCC_I2C8CFGR_I2C8EN_Pos                      (1U)
#define RCC_I2C8CFGR_I2C8EN_Msk                      (0x1UL << RCC_I2C8CFGR_I2C8EN_Pos)                     /*!< 0x00000002 */
#define RCC_I2C8CFGR_I2C8EN                          RCC_I2C8CFGR_I2C8EN_Msk                               /*!< I2C8 peripheral clocks enable */
#define RCC_I2C8CFGR_I2C8LPEN_Pos                    (2U)
#define RCC_I2C8CFGR_I2C8LPEN_Msk                    (0x1UL << RCC_I2C8CFGR_I2C8LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I2C8CFGR_I2C8LPEN                        RCC_I2C8CFGR_I2C8LPEN_Msk                             /*!< I2C8 peripheral clocks enable during CSleep mode */
#define RCC_I2C8CFGR_I2C8AMEN_Pos                    (3U)
#define RCC_I2C8CFGR_I2C8AMEN_Msk                    (0x1UL << RCC_I2C8CFGR_I2C8AMEN_Pos)                   /*!< 0x00000008 */
#define RCC_I2C8CFGR_I2C8AMEN                        RCC_I2C8CFGR_I2C8AMEN_Msk                             /*!< I2C8 autonomous clock mode enable */

/* Bit fields for RCC_SAI1CFGR register */
#define RCC_SAI1CFGR_SAI1RST_Pos                     (0U)
#define RCC_SAI1CFGR_SAI1RST_Msk                     (0x1UL << RCC_SAI1CFGR_SAI1RST_Pos)                    /*!< 0x00000001 */
#define RCC_SAI1CFGR_SAI1RST                         RCC_SAI1CFGR_SAI1RST_Msk                              /*!< SAI1 reset */
#define RCC_SAI1CFGR_SAI1EN_Pos                      (1U)
#define RCC_SAI1CFGR_SAI1EN_Msk                      (0x1UL << RCC_SAI1CFGR_SAI1EN_Pos)                     /*!< 0x00000002 */
#define RCC_SAI1CFGR_SAI1EN                          RCC_SAI1CFGR_SAI1EN_Msk                               /*!< SAI1 clock enable */
#define RCC_SAI1CFGR_SAI1LPEN_Pos                    (2U)
#define RCC_SAI1CFGR_SAI1LPEN_Msk                    (0x1UL << RCC_SAI1CFGR_SAI1LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_SAI1CFGR_SAI1LPEN                        RCC_SAI1CFGR_SAI1LPEN_Msk                             /*!< SAI1 clock enable during CSleep  */

/* Bit fields for RCC_SAI2CFGR register */
#define RCC_SAI2CFGR_SAI2RST_Pos                     (0U)
#define RCC_SAI2CFGR_SAI2RST_Msk                     (0x1UL << RCC_SAI2CFGR_SAI2RST_Pos)                    /*!< 0x00000001 */
#define RCC_SAI2CFGR_SAI2RST                         RCC_SAI2CFGR_SAI2RST_Msk                              /*!< SAI2 reset */
#define RCC_SAI2CFGR_SAI2EN_Pos                      (1U)
#define RCC_SAI2CFGR_SAI2EN_Msk                      (0x1UL << RCC_SAI2CFGR_SAI2EN_Pos)                     /*!< 0x00000002 */
#define RCC_SAI2CFGR_SAI2EN                          RCC_SAI2CFGR_SAI2EN_Msk                               /*!< SAI2 clock enable */
#define RCC_SAI2CFGR_SAI2LPEN_Pos                    (2U)
#define RCC_SAI2CFGR_SAI2LPEN_Msk                    (0x1UL << RCC_SAI2CFGR_SAI2LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_SAI2CFGR_SAI2LPEN                        RCC_SAI2CFGR_SAI2LPEN_Msk                             /*!< SAI2 clock enable during CSleep  */

/* Bit fields for RCC_SAI3CFGR register */
#define RCC_SAI3CFGR_SAI3RST_Pos                     (0U)
#define RCC_SAI3CFGR_SAI3RST_Msk                     (0x1UL << RCC_SAI3CFGR_SAI3RST_Pos)                    /*!< 0x00000001 */
#define RCC_SAI3CFGR_SAI3RST                         RCC_SAI3CFGR_SAI3RST_Msk                              /*!< SAI3 reset */
#define RCC_SAI3CFGR_SAI3EN_Pos                      (1U)
#define RCC_SAI3CFGR_SAI3EN_Msk                      (0x1UL << RCC_SAI3CFGR_SAI3EN_Pos)                     /*!< 0x00000002 */
#define RCC_SAI3CFGR_SAI3EN                          RCC_SAI3CFGR_SAI3EN_Msk                               /*!< SAI3 clock enable */
#define RCC_SAI3CFGR_SAI3LPEN_Pos                    (2U)
#define RCC_SAI3CFGR_SAI3LPEN_Msk                    (0x1UL << RCC_SAI3CFGR_SAI3LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_SAI3CFGR_SAI3LPEN                        RCC_SAI3CFGR_SAI3LPEN_Msk                             /*!< SAI3 clock enable during CSleep  */

/* Bit fields for RCC_SAI4CFGR register */
#define RCC_SAI4CFGR_SAI4RST_Pos                     (0U)
#define RCC_SAI4CFGR_SAI4RST_Msk                     (0x1UL << RCC_SAI4CFGR_SAI4RST_Pos)                    /*!< 0x00000001 */
#define RCC_SAI4CFGR_SAI4RST                         RCC_SAI4CFGR_SAI4RST_Msk                              /*!< SAI4 reset */
#define RCC_SAI4CFGR_SAI4EN_Pos                      (1U)
#define RCC_SAI4CFGR_SAI4EN_Msk                      (0x1UL << RCC_SAI4CFGR_SAI4EN_Pos)                     /*!< 0x00000002 */
#define RCC_SAI4CFGR_SAI4EN                          RCC_SAI4CFGR_SAI4EN_Msk                               /*!< SAI4 clock enable */
#define RCC_SAI4CFGR_SAI4LPEN_Pos                    (2U)
#define RCC_SAI4CFGR_SAI4LPEN_Msk                    (0x1UL << RCC_SAI4CFGR_SAI4LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_SAI4CFGR_SAI4LPEN                        RCC_SAI4CFGR_SAI4LPEN_Msk                             /*!< SAI4 clock enable during CSleep  */

/* Bit fields for RCC_MDF1CFGR register */
#define RCC_MDF1CFGR_MDF1RST_Pos                     (0U)
#define RCC_MDF1CFGR_MDF1RST_Msk                     (0x1UL << RCC_MDF1CFGR_MDF1RST_Pos)                    /*!< 0x00000001 */
#define RCC_MDF1CFGR_MDF1RST                         RCC_MDF1CFGR_MDF1RST_Msk                              /*!< MDF1 reset */
#define RCC_MDF1CFGR_MDF1EN_Pos                      (1U)
#define RCC_MDF1CFGR_MDF1EN_Msk                      (0x1UL << RCC_MDF1CFGR_MDF1EN_Pos)                     /*!< 0x00000002 */
#define RCC_MDF1CFGR_MDF1EN                          RCC_MDF1CFGR_MDF1EN_Msk                               /*!< MDF1 clock enable */
#define RCC_MDF1CFGR_MDF1LPEN_Pos                    (2U)
#define RCC_MDF1CFGR_MDF1LPEN_Msk                    (0x1UL << RCC_MDF1CFGR_MDF1LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_MDF1CFGR_MDF1LPEN                        RCC_MDF1CFGR_MDF1LPEN_Msk                             /*!< MDF1 clock enable during CSleep  */

/* Bit fields for RCC_FDCANCFGR register */
#define RCC_FDCANCFGR_FDCANRST_Pos                   (0U)
#define RCC_FDCANCFGR_FDCANRST_Msk                   (0x1UL << RCC_FDCANCFGR_FDCANRST_Pos)                  /*!< 0x00000001 */
#define RCC_FDCANCFGR_FDCANRST                       RCC_FDCANCFGR_FDCANRST_Msk                            /*!< FDCAN reset */
#define RCC_FDCANCFGR_FDCANEN_Pos                    (1U)
#define RCC_FDCANCFGR_FDCANEN_Msk                    (0x1UL << RCC_FDCANCFGR_FDCANEN_Pos)                   /*!< 0x00000002 */
#define RCC_FDCANCFGR_FDCANEN                        RCC_FDCANCFGR_FDCANEN_Msk                             /*!< FDCAN clock enable */
#define RCC_FDCANCFGR_FDCANLPEN_Pos                  (2U)
#define RCC_FDCANCFGR_FDCANLPEN_Msk                  (0x1UL << RCC_FDCANCFGR_FDCANLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_FDCANCFGR_FDCANLPEN                      RCC_FDCANCFGR_FDCANLPEN_Msk                           /*!< FDCAN clock enable during CSleep  */

/* Bit fields for RCC_HDPCFGR register */
#define RCC_HDPCFGR_HDPRST_Pos                       (0U)
#define RCC_HDPCFGR_HDPRST_Msk                       (0x1UL << RCC_HDPCFGR_HDPRST_Pos)                      /*!< 0x00000001 */
#define RCC_HDPCFGR_HDPRST                           RCC_HDPCFGR_HDPRST_Msk                                /*!< HDP reset */
#define RCC_HDPCFGR_HDPEN_Pos                        (1U)
#define RCC_HDPCFGR_HDPEN_Msk                        (0x1UL << RCC_HDPCFGR_HDPEN_Pos)                       /*!< 0x00000002 */
#define RCC_HDPCFGR_HDPEN                            RCC_HDPCFGR_HDPEN_Msk                                 /*!< HDP clock enable */

/* Bit fields for RCC_ADC12CFGR register */
#define RCC_ADC12CFGR_ADC12RST_Pos                   (0U)
#define RCC_ADC12CFGR_ADC12RST_Msk                   (0x1UL << RCC_ADC12CFGR_ADC12RST_Pos)                  /*!< 0x00000001 */
#define RCC_ADC12CFGR_ADC12RST                       RCC_ADC12CFGR_ADC12RST_Msk                            /*!< ADC12 reset */
#define RCC_ADC12CFGR_ADC12EN_Pos                    (1U)
#define RCC_ADC12CFGR_ADC12EN_Msk                    (0x1UL << RCC_ADC12CFGR_ADC12EN_Pos)                   /*!< 0x00000002 */
#define RCC_ADC12CFGR_ADC12EN                        RCC_ADC12CFGR_ADC12EN_Msk                             /*!< ADC12 clock enable */
#define RCC_ADC12CFGR_ADC12LPEN_Pos                  (2U)
#define RCC_ADC12CFGR_ADC12LPEN_Msk                  (0x1UL << RCC_ADC12CFGR_ADC12LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_ADC12CFGR_ADC12LPEN                      RCC_ADC12CFGR_ADC12LPEN_Msk                           /*!< ADC12 clock enable during CSleep  */
#define RCC_ADC12CFGR_ADC12KERSEL_Pos                (12U)
#define RCC_ADC12CFGR_ADC12KERSEL_Msk                (0x1UL << RCC_ADC12CFGR_ADC12KERSEL_Pos)               /*!< 0x00001000 */
#define RCC_ADC12CFGR_ADC12KERSEL                    RCC_ADC12CFGR_ADC12KERSEL_Msk                         /*!< ADC12 kernel clock source selection */

/* Bit fields for RCC_ADC3CFGR register */
#define RCC_ADC3CFGR_ADC3RST_Pos                     (0U)
#define RCC_ADC3CFGR_ADC3RST_Msk                     (0x1UL << RCC_ADC3CFGR_ADC3RST_Pos)                    /*!< 0x00000001 */
#define RCC_ADC3CFGR_ADC3RST                         RCC_ADC3CFGR_ADC3RST_Msk                              /*!< ADC3 reset */
#define RCC_ADC3CFGR_ADC3EN_Pos                      (1U)
#define RCC_ADC3CFGR_ADC3EN_Msk                      (0x1UL << RCC_ADC3CFGR_ADC3EN_Pos)                     /*!< 0x00000002 */
#define RCC_ADC3CFGR_ADC3EN                          RCC_ADC3CFGR_ADC3EN_Msk                               /*!< ADC3 clock enable */
#define RCC_ADC3CFGR_ADC3LPEN_Pos                    (2U)
#define RCC_ADC3CFGR_ADC3LPEN_Msk                    (0x1UL << RCC_ADC3CFGR_ADC3LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_ADC3CFGR_ADC3LPEN                        RCC_ADC3CFGR_ADC3LPEN_Msk                             /*!< ADC3 clock enable during CSleep  */
#define RCC_ADC3CFGR_ADC3KERSEL_Pos                  (12U)
#define RCC_ADC3CFGR_ADC3KERSEL_Msk                  (0x3UL << RCC_ADC3CFGR_ADC3KERSEL_Pos)                 /*!< 0x00003000 */
#define RCC_ADC3CFGR_ADC3KERSEL                      RCC_ADC3CFGR_ADC3KERSEL_Msk                           /*!< ADC3 kernel clock source select */

