STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_ca35.h
/**************  Bit definition for SYSCFG_VDDIO4CCCR register  ***************/
#define SYSCFG_VDDIO4CCCR_RANSRC_Pos                                       (0U)
#define SYSCFG_VDDIO4CCCR_RANSRC_Msk                                       (0xFUL << SYSCFG_VDDIO4CCCR_RANSRC_Pos)                                         /*!< 0x0000000F */
#define SYSCFG_VDDIO4CCCR_RANSRC                                           SYSCFG_VDDIO4CCCR_RANSRC_Msk                                                   /*!< NMOS compensation code of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCCR_RAPSRC_Pos                                       (4U)
#define SYSCFG_VDDIO4CCCR_RAPSRC_Msk                                       (0xFUL << SYSCFG_VDDIO4CCCR_RAPSRC_Pos)                                         /*!< 0x000000F0 */
#define SYSCFG_VDDIO4CCCR_RAPSRC                                           SYSCFG_VDDIO4CCCR_RAPSRC_Msk                                                   /*!< PMOS compensation code of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCCR_EN_Pos                                           (8U)
#define SYSCFG_VDDIO4CCCR_EN_Msk                                           (0x1UL << SYSCFG_VDDIO4CCCR_EN_Pos)                                             /*!< 0x00000100 */
#define SYSCFG_VDDIO4CCCR_EN                                               SYSCFG_VDDIO4CCCR_EN_Msk                                                       /*!< VDDIO4 I/Os compensation cell enable */
#define SYSCFG_VDDIO4CCCR_CS_Pos                                           (9U)
#define SYSCFG_VDDIO4CCCR_CS_Msk                                           (0x1UL << SYSCFG_VDDIO4CCCR_CS_Pos)                                             /*!< 0x00000200 */
#define SYSCFG_VDDIO4CCCR_CS                                               SYSCFG_VDDIO4CCCR_CS_Msk                                                       /*!< VDDIO4 I/Os code selection */

/**************  Bit definition for SYSCFG_VDDIO4CCSR register  ***************/
#define SYSCFG_VDDIO4CCSR_ANSRC_Pos                                        (0U)
#define SYSCFG_VDDIO4CCSR_ANSRC_Msk                                        (0xFUL << SYSCFG_VDDIO4CCSR_ANSRC_Pos)                                          /*!< 0x0000000F */
#define SYSCFG_VDDIO4CCSR_ANSRC                                            SYSCFG_VDDIO4CCSR_ANSRC_Msk                                                    /*!< NMOS compensation value of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCSR_APSRC_Pos                                        (4U)
#define SYSCFG_VDDIO4CCSR_APSRC_Msk                                        (0xFUL << SYSCFG_VDDIO4CCSR_APSRC_Pos)                                          /*!< 0x000000F0 */
#define SYSCFG_VDDIO4CCSR_APSRC                                            SYSCFG_VDDIO4CCSR_APSRC_Msk                                                    /*!< PMOS compensation value of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCSR_READY_Pos                                        (8U)
#define SYSCFG_VDDIO4CCSR_READY_Msk                                        (0x1UL << SYSCFG_VDDIO4CCSR_READY_Pos)                                          /*!< 0x00000100 */
#define SYSCFG_VDDIO4CCSR_READY                                            SYSCFG_VDDIO4CCSR_READY_Msk                                                    /*!< VDDIO4 I/Os compensation cell ready flag */

/****************  Bit definition for SYSCFG_VDDCCCR register  ****************/
#define SYSCFG_VDDCCCR_RANSRC_Pos                                          (0U)
#define SYSCFG_VDDCCCR_RANSRC_Msk                                          (0xFUL << SYSCFG_VDDCCCR_RANSRC_Pos)                                            /*!< 0x0000000F */
#define SYSCFG_VDDCCCR_RANSRC                                              SYSCFG_VDDCCCR_RANSRC_Msk                                                      /*!< NMOS compensation code of the I/Os supplied by VDD */
#define SYSCFG_VDDCCCR_RAPSRC_Pos                                          (4U)
#define SYSCFG_VDDCCCR_RAPSRC_Msk                                          (0xFUL << SYSCFG_VDDCCCR_RAPSRC_Pos)                                            /*!< 0x000000F0 */
#define SYSCFG_VDDCCCR_RAPSRC                                              SYSCFG_VDDCCCR_RAPSRC_Msk                                                      /*!< PMOS compensation code of the I/Os supplied by VDD */
#define SYSCFG_VDDCCCR_EN_Pos                                              (8U)
#define SYSCFG_VDDCCCR_EN_Msk                                              (0x1UL << SYSCFG_VDDCCCR_EN_Pos)                                                /*!< 0x00000100 */
#define SYSCFG_VDDCCCR_EN                                                  SYSCFG_VDDCCCR_EN_Msk                                                          /*!< VDD I/Os compensation cell enable */
#define SYSCFG_VDDCCCR_CS_Pos                                              (9U)
#define SYSCFG_VDDCCCR_CS_Msk                                              (0x1UL << SYSCFG_VDDCCCR_CS_Pos)                                                /*!< 0x00000200 */
#define SYSCFG_VDDCCCR_CS                                                  SYSCFG_VDDCCCR_CS_Msk                                                          /*!< VDD I/Os code selection */

/****************  Bit definition for SYSCFG_VDDCCSR register  ****************/
#define SYSCFG_VDDCCSR_ANSRC_Pos                                           (0U)
#define SYSCFG_VDDCCSR_ANSRC_Msk                                           (0xFUL << SYSCFG_VDDCCSR_ANSRC_Pos)                                             /*!< 0x0000000F */
#define SYSCFG_VDDCCSR_ANSRC                                               SYSCFG_VDDCCSR_ANSRC_Msk                                                       /*!< NMOS compensation value of the I/Os supplied by VDD */
#define SYSCFG_VDDCCSR_APSRC_Pos                                           (4U)
#define SYSCFG_VDDCCSR_APSRC_Msk                                           (0xFUL << SYSCFG_VDDCCSR_APSRC_Pos)                                             /*!< 0x000000F0 */
#define SYSCFG_VDDCCSR_APSRC                                               SYSCFG_VDDCCSR_APSRC_Msk                                                       /*!< PMOS compensation value of the I/Os supplied by VDD */
#define SYSCFG_VDDCCSR_READY_Pos                                           (8U)
#define SYSCFG_VDDCCSR_READY_Msk                                           (0x1UL << SYSCFG_VDDCCSR_READY_Pos)                                             /*!< 0x00000100 */
#define SYSCFG_VDDCCSR_READY                                               SYSCFG_VDDCCSR_READY_Msk                                                       /*!< VDD I/Os compensation cell ready flag */

